from aiogram import Dispatcher
from aiogram.types import Message

from app.keyboards.reply.back import back_kb


async def typical_question(msg: Message):
    text = (
        '💠 <b>Чи можна приходити з домашніми улюбленцями?</b>\n\n'
        '- Так, тільки без допуску на пісок.\n\n'
        '💠 <b>Чи є у нас абонементи?</b>\n\n'
        '- Так, є. Ви можете придбати абонемент, який містить 10 годин оренди кортів. '
        'До кінця календарного місяця Ви можете витрачати ці 10 годин коли забажаєте. '
        'Просимо звернути увагу, що є два типу абонементів, котрі відрізняються доступними '
        'годинами/днями бронювання!\n\n'
        '💠 <b>Чи можна у нас придбати воду?</b>\n\n'
        '- Так можна і ще багато речей, які можуть знадобитися (капці, рушники, батончики, брендований одяг)\n'
    )
    await msg.answer(text, reply_markup=back_kb)


async def about_complex(msg: Message):
    text = (
        'СЕТ - центр пляжних видів спорту 🇺🇦.\n\n'
        'Тренуйся, грай, відпочивай на теплому піску цілий рік.\n'
        '«СЕТ», бери друзів, сім\'ю і до нас – тренуйся, грай, відпочивай на теплому піску цілий рік.🏖\n'
        '✔️ 1200 квадратних метрів піску з подігрівом.\n'
        '✔️ 4 критих кортів.\n'
        '✔️ 6 видів спорту.\n'
        '✔️ групові та індивідуальні тренування.\n'
        '✔️ температура повітря та піску на кортах 16-19 градусів.\n'
        '✔️ роздягальні\n'
        '✔️ душ🚿\n'
        '✔️тренажери\n'
        '✔️ лаунж\n'
        '✔️ кафе\n'
        '🕐 Працюємо з 7:00 до 22:00\n'
        '📍м. Київ, Х парк. Посилання на карту: https://maps.app.goo.gl/nvXPj6183aoYF9Dq5?g_st=ic\n'
        '📲 098 522 69 68\n\n'
        'Instagram: @set.in.ua\n\n'
        'https://set.in.ua/\n\n'
        'СЕТ - завжди гарна погода!☀\n'
        '‼️Правила‼️\n\n'
        '1. Відмінити бронювання можна не пізніше ніж за 8 годин.⏳\n'
        '2. Потрібно мати змінні капці або ж придбати одноразові на рецепції.\n '
        '3. Не можна виносити їжу на пісок.\n'
        '4. Не можна виносити напої окрім води у пластмасовій пляшці на пісок.\n'
        '5. Не можна перебувати на корті з голим торсом.\n'
        '6. Треба вирівняти корт після себе(почати за 5хв до кінця броні).\n'
        '7. Обов‘язково мати при собі гарний настрій!☺\n'
    )
    await msg.answer(text, reply_markup=back_kb)


async def others(msg: Message):
    text = (
        'Інші послуги:\n\n'
        '1. Оренда кортів\n'
        '2  Оренда м‘ячів\n'
        '3. Тренування та турніри\n'
        '4. Дитячі свята\n'
        '5. Дні народження / Корпоративи\n'
        '6. Аренда бару\n'
        '6. Масажний кабінет\n'
    )
    await msg.answer(text, reply_markup=back_kb)


def setup(dp: Dispatcher):
    dp.register_message_handler(typical_question, text='Типові питання ❓', state='*')
    dp.register_message_handler(about_complex, text='Про комплекс 🏐', state='*')
    dp.register_message_handler(others, text='Інші послуги ℹ', state='*')
